// regex.js

const regex = {
    // 邮箱格式校验
    email: /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/,
  
    // 手机号格式校验
    phone: /^1\d{10}$/,
  
    // 身份证号（一代、二代）格式校验
    idCard: /(^\d{15}$)|(^\d{17}(\d|X|x)$)/,
  
    // 中文字符校验
    chinese: /^[\u4e00-\u9fa5]+$/,
  
    // 整数校验（包括正整数和负整数）
    integer: /^-?\d+$/,
  
    // 正整数校验
    positiveInteger: /^[1-9]\d*$/,
  
    // 浮点数校验（包括正浮点数和负浮点数）
    float: /^-?\d+(\.\d+)?$/,
  
    // 正浮点数校验
    positiveFloat: /^[1-9]\d*(\.\d+)?$/,
  
    // 英文字母校验（大小写不敏感）
    alphabet: /^[A-Za-z]+$/,
  
    // 网址校验（支持 http 和 https）
    url: /^(https?:\/\/)?[\w.-]+\.[a-zA-Z]{2,}(\/\S*)?$/,
  
    // IP 地址校验（IPv4）
    ipv4: /^((25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d)\.){3}(25[0-5]|2[0-4]\d|1\d{2}|[1-9]?\d)$/,
  
    // 日期格式校验（YYYY-MM-DD）
    date: /^\d{4}-\d{2}-\d{2}$/,
  
    // 时间格式校验（HH:mm:ss）
    time: /^([01]\d|2[0-3]):[0-5]\d:[0-5]\d$/,
  
    // 日期时间格式校验（YYYY-MM-DD HH:mm:ss）
    dateTime: /^\d{4}-\d{2}-\d{2} ([01]\d|2[0-3]):[0-5]\d:[0-5]\d$/,
  };
  
  export default regex;
  